{
	"help":[
		"Binary Quiz это игра, нацеленная на обучение быстрому переводу чисел между системами счисления",
		"В игре есть 4 режима сложности\n- Обучение. Используются числа не больше 32, есть наэкранные подсказки\n- Легкий. Числа не больше 54\n- Продвинутый. 256\n- PRO. Числа до 2048, ввод осуществляется с помощью клавиатура из трех кнопок - \"1\", \"0\" и \"Очистить\" ",
		"Позиционная двоичная система счисления - такая система, числа которой представляются двумя разными цифрами: обычно 1 и 0",
		"Bin -> Dec перевод\nдвоичное число: 110001\n1 * 2^5 + 1 * 2^4 + 0 * 2^3 + 0 * 2^2 + 0 * 2^1 + 1 * 2^0 = 49\nдесятичное: 49",
		"Dec -> Bin\nдесятичное: 19\nI способ\na/b = a div b (a mod b):\n19/2 = 9 (1)\n9/2 = 4   (1)\n4/2 = 2   (0)\n2/2 = 1   (0)\n1/2 = 0   (1)\nдвоичное: 10011\nII способ\n19 = 16 + 2 + 1 = 2^4 + 2^1 + 2^0 = \n1*2^4+0^3+0^2+1*2^1+1*2^0=10011",
		"2^x=a, x:\n0\t=\t1\n1\t=\t2\n2\t=\t4\n3\t=\t8\n4\t=\t16\n5\t=\t32\n6\t=t64\n7\t=\t128\n8\t=\t256\n9\t=512\n10\t=\t1024",
		"Автор: Марк Симановский aka Sinapsel\n с 6 янв 2017",
		"Лицензия\n\nCopyright (c) jan 2017 Sinapsel\n\nДанная лицензия разрешает лицам,\nполучившим копию данного программного обеспечения и сопутствующей документации (в дальнейшем именуемыми «Программное Обеспечение»),\nбезвозмездно использовать Программное Обеспечение без ограничений, исключая право релецензирования и продажи,\nвключая право на использование, копирование и изменение изменение при соблюдении следующих условий:\n\n Вышеупомянутое уведомление об авторских правах и это уведомление о разрешении должны быть включены во все некоммерческие копии или существенные части Программного обеспечения.\n Запрещается использовать Программное обеспечение для коммерческих целей\n\nПрограммное обеспечение предоставляется «как есть», без каких-либо гарантий, явных или подразумеваемых,\nВ том числе, но не ограничиваясь гарантиями пригодности для определенной цели и отсутствия нарущений\nНи в коем случае авторы или правообладатели не несут ответственности по каким-либо искам за\n УЩЕРБ\n ИЛИ ПО ИНЫМ ТРЕБОВАНИЯМ, В ТОМ ЧИСЛЕ, ПРИ ДЕЙСТВИИ КОНТРАКТА, ДЕЛИКТЕ ИЛИ ИНОЙ СИТУАЦИИ, ВОЗНИКШИМ ИЗ-ЗА\n ИСПОЛЬЗОВАНИЯ ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ ИЛИ ИНЫХ ДЕЙСТВИЙ С ПРОГРАММНЫМ ОБЕСПЕЧЕНИЕМ."
	],
	
	"menuInterface":[
		"\tРекорд: ",
		"Сложность",
		"Обучение",
		"Легкий",
		"Продвинутый",
		"PRO",
		"Калькулятор Систем Счисления",
		"Помощь",
		"Выход"
	],
	"gamePlay":[
		"Пауза",
		"Продолжить",
		"Меню",
		"\tОчки: ",
		"Перезапуск"
	],
	"mutattor":[
		"Назад"
	]
}